
//------------------------------------------------------------
//	g_tools.h		グラフィック周りの基本関数
//------------------------------------------------------------

//#include	<windows.h>
//#include	<stdio.h>
//#include	"ADV_BasicTips.h"
//#include	"TextEngine.h"

extern	HINSTANCE	hinst;		//実行ファイルのインスタンスのハンドル
extern	HWND		hwnd;		//ウィンドウのハンドル


//-----------------------------------------------------------
//	一番お手軽なBMP読み込み
//-----------------------------------------------------------

int Load_Bmp( HDC hdc, char *f_name_of_BMP);


//-----------------------------------------------------------
//	フルカラーBMP限定の自力読み込み関数
//-----------------------------------------------------------

int Load_Fullcolor_Bmp( HDC hdc, char *f_name_of_BMP);
	//フルカラーBMPの読み込み（インデックスカラーは無視）


//------------------------------------------------
//	文字列表示（影付き）
//------------------------------------------------

int    StrPut3D(HDC hdc,int x,int y,int fontSize,UINT color1,UINT color2,char *str);
	//文字列表示（↑３Dってのは語弊があるかも：笑）


//------------------------------------------------
//	１文字表示（影付き）
//------------------------------------------------

int    ChrPut3D(HDC hdc,int x,int y,int fontSize,
				UINT color1,UINT color2,char *str,int len);
	//１文字表示（↑３Dってのは語弊があるかも：笑）
	//	len：表示する文字のバイト数（1 or 2）

//------------------------------------------------
//	直線を描く
//------------------------------------------------

void	Line(HDC hdc,int x1,int y1,int x2,int y2,UINT color,int penfat);


//------------------------------------------------
//	四角形を描く（枠だけ）
//------------------------------------------------

void	Box(HDC hdc,RECT rect,UINT color);


//------------------------------------------------
//	四角形を描く（ぬりつぶし）
//------------------------------------------------

void	Boxf(HDC hdc,RECT rect,UINT color);



//------------------------------------------------
//	リソースBMPのロード
//------------------------------------------------

void	DrawResBmploadRect(HINSTANCE hinst,HDC hdc,int x,int y,RECT rect,LPCTSTR lpszBitmap);
	//RECT rect：リソース画像の転送したい領域を指定


//------------------------------------------------
//	リソースBMPの特定のピクセルをGET
//------------------------------------------------

COLORREF 	GetPixelResBmp(HDC hdc,HINSTANCE hinst,int x,int y,LPCTSTR lpszBitmap);


//end of file

