//-----------------------------------------------------------------------------------------
//	TexitEngine.h
//-----------------------------------------------------------------------------------------

//#include	"BasicTips.h"
//#include	"g_tool.h"
//#include	"main.h"
//#include	<windows.h>

//extern HWND hwnd;

//###################################################################
//	ＴＥＸＴエンジン
//###################################################################
	

#define			SIZE_OF_TEXT_BUF 0xffff		//64KBもあればバッファとしては充分でしょう

extern unsigned char	TEXT_BUF[SIZE_OF_TEXT_BUF];	//スクリプトを読み込むエリア

extern unsigned char	*TEXT;	//Text pointer（テキスト解釈位置をポイントします）

extern int		Font_Size;	//フォントサイズ

extern int		TEXT_WAIT;		//１文字表示のウェイト
extern RECT		TEXT_AREA;		//テキストを展開する画面領域
extern int		TEXT_X;			//現在の表示位置Ｘ
extern int		TEXT_Y;			//現在の表示位置Ｙ
extern int		TEXT_X_PITCH;	//文字送りピッチＸ
extern int		TEXT_Y_PITCH;	//文字送りピッチＹ

extern DWORD	TEXT_TIMER;		//タイマー

//-------------------------------------
//	TEXTエンジン初期化
//-------------------------------------

void _Set_Default_params();
	//デフォルトパラメータの設定

void Init_Text_engine();
	//イニシャライズ操作の「親」関数


//-------------------------------------
//	文字位置のインクリメント
//-------------------------------------

void Increment_textp_pos(int inc);	
	//文字表示位置のインクリメント
	//	int inc：何byteインクリメントするか→１or2

//-------------------------------------
//	１０進数テキストの解析
//-------------------------------------

int kaiseki_10();

//-------------------------------------------
//	テキスト文字列の解析（スペース+[,]区切り版）
//-------------------------------------------

char *Kaiseki_TextStr();

//-------------------------------------------
//	テキスト文字列の解析（[CR]区切り版）
//-------------------------------------------

char *Kaiseki_TextStr_CR();

//###############################################################
//	TEXTエンジン（シナリオ･インタプリタ）本体部
//###############################################################

//-------------------------------------
//	ここがエンジン部本体ね♪
//-------------------------------------
int Text_engine();


//end of file

