
//------------------------------------------------------------
//	g_tools.h		グラフィック周りの基本関数
//------------------------------------------------------------

//-----------------------------------------------------------
//	一番お手軽なBMP読み込み
//-----------------------------------------------------------

int Load_Bmp( HDC hdc, char *f_name_of_BMP);

//-----------------------------------------------------------
//	フルカラーBMP限定の自力読み込み関数
//-----------------------------------------------------------

int Load_Fullcolor_Bmp( HDC hdc, char *f_name_of_BMP);
	//フルカラーBMPの読み込み（インデックスカラーは無視）

//------------------------------------------------
//	文字列表示（影付き）
//------------------------------------------------

int    StrPut3D(HDC hdc,int x,int y,int fontSize,UINT color1,UINT color2,char *str);


//end of file

