//-----------------------------------------------------------------------------------------
//	Com_01.h	スクリプトコマンド：その１
//-----------------------------------------------------------------------------------------

//#include	"BasicTips.h"
//#include	"g_tool.h"
//#include	"main.h"
//#include	"TextEngine.h"
//#include	<windows.h>

//------------------------------------------------------------
//	遅延
//------------------------------------------------------------

int Com_delay()
	//遅延処理のファーストショット。タスク（ループ）を
	//回すための準備をしておしまい
{



	return 0;
}

int Com_delay_task()
	//遅延処理のタスク部分。Mainloop() から延々と呼ばれ続ける
{


	return 0;
}



//end of file

