//----------------------------------------------------------------------
//	ちょー簡単ＲＰＧ（ＲＰＧ講座初級編）	ゲームメイン
//----------------------------------------------------------------------
//		作った人：ソフト屋 巣 http://softyasu.net/
//----------------------------------------------------------------------


#include <DxLib.h>

#include "main.h"
#include "comsub.h"
#include "gameMain.h"


//----------------------------------------------------------------------
//	定数
//----------------------------------------------------------------------


//----------------------------------------------------------------------
//	変数
//----------------------------------------------------------------------





//----------------------------------------------------------------------
//	ゲーム本編
//----------------------------------------------------------------------
GameState_t GameMain()
{
	//	ゲーム本編だよって表示
	CenterDrawString( "ゲーム本編です。", 28, 160, GetColor(255,255,255) );
	
	//	ゲームオーバーのキー入力
	CenterDrawString( "「G」ボタンでゲームオーバーになります。", 20, 240, GetColor(155,155,255) );
	if( g_MainData.key[KEY_INPUT_G] == 1) {
		return GAME_STATE_GAMEOVER;
	}
	//	エンディングのキー入力
	CenterDrawString( "「E」ボタンでエンディングになります。", 20, 280, GetColor(155,155,255) );
	if( g_MainData.key[KEY_INPUT_E] == 1) {
		return GAME_STATE_ENDING;
	}
	
	//	継続
	return g_MainData.gameState;
}


